Revit 2027 API
BuiltInFailures.SketchFailures.CannotComputeRailingsElevationError Property
 Can't compute Railings Elevation Profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotComputeRailingsElevationError { get; }
Public Shared ReadOnly Property CannotComputeRailingsElevationError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotComputeRailingsElevationError {
	FailureDefinitionId^ get ();
}
static member CannotComputeRailingsElevationError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace